[
  {
    "filename": "HC@B_Shared_Commitments_(Covenant)_v1.1.html",
    "category": "Core Guide",
    "title": "House Church at Birmingham Shared Commitments - v.1.",
    "date": "12/2023",
    "tags": [
      "Shared finances & commitment to generosity",
      "Shared turf",
      "Shared seeking of quick reconciliation with one another",
      "Shared life discernment",
      "Shared caring for one another",
      "Shared gospel proclamation & discipleship",
      "Shared responsibility for sending/supporting global workers",
      "Shared seeking of justice & peace",
      "Reflection: Spiritual Gifts Sunday"
    ],
    "summary_snippet": "House Church at Birmingham Shared Commitments - v.1. 1 Completed 12/2023 Preamble : A c ovenant is \"a relationship between two partners who make binding promises to each other and work together to reach a common goal. ” The below items and their “fleshing out” came from a series of discussions, open to all folks who participate in the life of our church , throughout 2023. These covenant items are all predicated  by our shared submission to the Holy Spirit and Christ as the head of the church, confessing that Jesus is King & seeking to follow Him. Items: Shared caring for one another Shared life discernment Shared finances & commitment to generosity Shared gospel proclamation & discipleship Shared seeking of justice & peace Shared turf Shared responsibility for sending/supporting global workers Shared seeking of quick reconciliation with one another We will emphasize each of these at points throughout the year, on the following Sundays: Shared caring for one another Reflection: Spiritual Gifts Sunday Shared life discernment Reflection: Interdependence Sunday Shared finances & commitment to generosity Reflection: ThanksGIVING Sunday Shared gospel proclamation & discipleship Reflection: Random September Sunday Shared seeking of justice & peace Reflection: Sunday after Martin Luther King, Jr. Day Shared turf Reflection: A springtime (?) Sunday we can try to do together with CCWW or ?? Shared responsibility for sending/supporting global workers Reflection: Sunday before GMHC Shared seeking of quick reconciliation with one another Reflection: Peacemaking Sunday Fleshing Out The Covenant Items: Shared caring for one another Commitment to unity- henótēs (from heis, \"one\") – oneness (unity), especially the God-produced unity (oneness) between believers – i.e. the harmony from sharing likeness of nature with the Lord (used only in Eph 4:3,13) Abiding by the apostles creed; ok not being from all the same denomination etc., being willing to disagree on some topics while [this sentence is incomplete in the earliest manuscripts :) ] 1.Cor 13; love is the foundation where a lot of these other things come about as we are walking through life deeply with each other Need to be intentional with each other throughout the week & be known by each other well Submission to one another"
  }
]