{
    "query": "Honda Civic 2012 key programming guide reddit forum",
    "results": [
        {
            "title": "Key Fob Remote Programming (Door Locks)",
            "content": "Many Reddit discussions indicate that the remote portion of a 2012 Honda Civic key fob can often be programmed manually by the owner. The general steps usually involve a sequence of turning the ignition on and off and pressing buttons on the remote.\n\nA common method found on Reddit includes the following steps:\n1. Gather all remotes you wish to program. All remotes must be programmed in the same session, as the car may \"forget\" previously programmed ones.\n2. Sit in the vehicle with all doors and the trunk closed.\n3. Turn the key to the \"ON\" position (where the dash lights come on, but the engine isn't started), then within five seconds, press the \"Lock\" button on the remote for about one second.\n4. Turn the key to the \"OFF\" position.\n5. Repeat steps 3 and 4 three more times for a total of four ON/OFF cycles. Each step must be completed within five seconds.\n6. On the fourth turn to the \"ON\" position, press the \"Lock\" button on your remote. The car's locks should make a \"clunk\" sound, indicating it has entered remote programming mode.\n7. Within ten seconds, press the \"Lock\" button on any additional remotes you want to program. The locks should \"clunk\" after each successful programming.\n8. Turn the key to the \"OFF\" position and remove it from the ignition. Test all remotes.",
            "source": "Reddit Summary"
        },
        {
            "title": "Transponder Chip Programming (Engine Start)",
            "content": "For the transponder chip inside the key, which is essential for the car's immobilizer system to allow the engine to start, self-programming is generally not possible for a 2012 Honda Civic. This part of the key typically requires specialized equipment, such as a scan tool, to be programmed through the car's immobilizer module. Most modern Hondas require authorized credentials to perform this pairing procedure, meaning a dealership or a professional locksmith with the necessary software and tools will likely be needed.",
            "source": "Reddit Summary"
        }
    ]
}